import {
  Entypo,
  MaterialCommunityIcons,
  MaterialIcons,
} from "@expo/vector-icons";

import {
  HerculesStoryImages,
  RapunzelStoryImages,
  cinderellaOption,
  cinderellaStoryImages,
  herculesOption,
  rapunzelOption,
} from "../assets/images/imageIndex";
import { colorVariants } from "./globalConstants";

export const SinhalaString = () => {
  return {
    screenTitles: {
      MainMenu: "ප්‍රධාන මෙනුව",
      StorySelection: "කතන්දර තේරීම",
      CinderellaStory: "සින්ඩරෙල්ලා",
      RapunzelStory: "රපුන්සෙල්",
      HerculesStory: "හර්කියුලිස්",
      GameCompletion: "සංඛ්යාලේඛන",
    },
    storySelectionOptions: [
      { title: "සින්ඩරෙල්ලා", ref: cinderellaOption },
      { title: "රපුන්සෙල්", ref: rapunzelOption },
      { title: "හර්කියුලිස්", ref: herculesOption },
    ],
    gameStats: [
      { text: "කතාව අවසන් වන වේලාව", value: 0, unit: "minutes" },
      { text: "වැරදි උත්සාහයන්", value: 0, unit: "attempts" },
      {
        text: "සාමාන්‍යයෙන් ප්‍රශ්නයකට ගත කරන කාලය",
        value: 0,
        unit: "minutes",
      },
    ],
    gameCompletionText: {
      proceedToMainMenu: "ප්රධාන මෙනුව වෙත යන්න",
      statistics: "සංඛ්යාලේඛන",
    },

    studentSelectionOptions: [
      {
        title: "ප්රහේලිකාව",
        Icon: (
          <MaterialCommunityIcons
            name="puzzle"
            size={200}
            color={colorVariants.dodgerblue}
          />
        ),
      },
      {
        title: "කතාව",
        Icon: (
          <Entypo
            name="open-book"
            size={200}
            color={colorVariants.dodgerblue}
          />
        ),
      },
      {
        title: "ධාවන ලැයිස්තුව",
        Icon: (
          <MaterialCommunityIcons
            name="playlist-music"
            size={200}
            color={colorVariants.dodgerblue}
          />
        ),
      },
      {
        title: "සැකසීම්",
        Icon: (
          <MaterialIcons
            name="settings"
            size={200}
            color={colorVariants.dodgerblue}
          />
        ),
      },
    ],
    studentSelectionSpeech:
      "සාදරයෙන් පිළිගනිමු! ඔබ ප්‍රධාන මෙනුවේ සිටී. අපගේ පළමු විකල්පය විනෝදජනක ප්‍රහේලිකාවකි! ඔබට එය විසඳිය හැකිද? දෙවන විකල්පය ඉන්ද්‍රජාලික කතාවකි. ඔබ පරිකල්පන ලෝකයකට කිමිදීමට සූදානම්ද? තුන්වන විකල්පය ධාවන ලැයිස්තුවකි. අපි බලමු එකට සිසිල් නාද කිහිපයකට සවන් දෙන්න! අවසාන වශයෙන් නොව, අවම වශයෙන්, හතරවන විකල්පය වන්නේ සැකසීම් ය. මෙහිදී ඔබට ඒවා ඔබට ගැලපෙන පරිදි වෙනස් කළ හැක! ඉතින්, එය කුමක් වේවිද?",
    storySelectionSpeech:
      "ඔබ සිටින්නේ කතන්දර පාදක ක්‍රීඩා අංශයේය! දැන්, ඉන්ද්‍රජාලික වික්‍රමාන්විතයක් තෝරා ගැනීමට කාලයයි. ඔබේ පළමු තේරීම සින්ඩරෙල්ලාගේ සිත් ඇදගන්නා කතාවයි, ඊළඟට ඇගේ දිගු රන්වන් හිසකෙස් ඇති රපුන්සෙල්ගේ ඉහළ පියාසර ගමනයි, සහ අවසාන වශයෙන් නොව අවම වශයෙන් නොවේ. , බලසම්පන්න සහ නිර්භීත හර්කියුලිස්, ඉතින්, ඔබ අද ආරම්භ කරන්නේ කුමන අපූරු ගමනක්ද?",
    settingsModal: {
      logout: "පිටවීම",
      logoutConfirmation: "ඔබට පිටවීමට අවශ්‍ය?",
      cancel: "අවලංගු කරන්න",
      cancelPress: "Cancel Pressed",
      settings: "සැකසුම්",
      selectedLanguage: "භාෂාව තෝරන්න",
      saveSettings: "සැකසුම් සුරකින්න",
    },
    loginAndSignup: {
      invalidCredentials: "වලංගු නොවන අක්තපත්‍ර",
      credentialsExist: "පරිශීලක නාමය දැනටමත් පවතී",
      enterCredentialsToLogin: "පුරනය වීමට ඔබගේ අක්තපත්‍ර ඇතුලත් කරන්න",
      quickSignup: "ඉක්මන් ලියාපදිංචිය",
      userName: "පරිශීලක නාමය",
      password: "මුරපදය",
      signUpTeacher: "ගුරුවරයෙකු ලෙස ලියාපදිංචි වන්න?",
      login: "ඇතුල් වන්න?",
      btnLogin: "ඇතුල් වන්න",
      btnSignup: "ලියාපදිංචි වන්න",
    },

    CinderellaStoryContent: [
      {
        imageId: cinderellaStoryImages.cinderellaImage1,
        passageId: 1,
        passageContent:
          "එක් කලෙක දුර ඈත රාජධානියක සින්ඩරෙල්ලා නම් කරුණාවන්ත මෘදු ගැහැණු ළමයෙකු ජීවත් වූවාය, ඇයට කරුණාවන්ත හදවතක් තිබුණි, නමුත් ඇගේ කුඩා මව සහ සුළු සහෝදරියන් එතරම් නොසිටි නිසා ඇගේ විශාල නිවසේ සියලු කටයුතු කිරීමට ඇයට සිදු විය. ඇය ගැන සතුටුයි. ඇයට තිබූ එකම සතුට ඇගේ බල්ලා බෲනෝ",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "පින්තූරේ ඉන්න කෙල්ල කවුද?",
              options: [
                "සින්ඩරෙල්ලා",
                "කුඩම්මා",
                "ස්ටෙප්සිස්ටර්",
                "සුරංගනා දේව මෑණියන්",
              ],
              correctAnswer: "සින්ඩරෙල්ලා",
            },
            {
              questionId: 2,
              question: "පින්තූරයේ සින්ඩරෙල්ලාට දැනෙන්නේ කෙසේද?",
              options: ["දුකයි", "සතුටුයි", "කෝපයි", "බයයි"],
              correctAnswer: "සතුටුයි",
            },
            {
              questionId: 3,
              question: "සින්ඩරෙල්ලා ඇගේ අතින් කරන්නේ කුමක්ද?",
              options: [
                "ඇගේ බල්ලා සුරතල් කිරීම",
                "කොස්සක් අල්ලාගෙන",
                "හලෝ හලෝ",
                "ඇගේ අත්පුඩි ගසමින්",
              ],
              correctAnswer: "ඇගේ බල්ලා සුරතල් කිරීම",
            },
            {
              questionId: 4,
              question: "පින්තූරයේ සින්ඩරෙල්ලාගේ ඇඳුමේ වර්ණය කුමක්ද?",
              options: ["නිල්", "රෝස", "කොළ", "කහ"],
              correctAnswer: "නිල්",
            },
            {
              questionId: 5,
              question: "සින්ඩරෙල්ලා බල්ලාගේ නම කුමක්ද?",
              options: ["බෲනෝ", "මැක්ස්", "ස්පොට්", "රෙක්ස්"],
              correctAnswer: "බෲනෝ",
            },
          ],
          medium: [
            {
              questionId: 1,
              question:
                "ඇයි සින්ඩරෙල්ලාට එයාගේ ලොකු ගෙදර හැම වැඩක්ම කරන්න වෙන්නේ?",
              options: [
                "ඇය පිරිසිදුව සිටීමට කැමති නිසා",
                "ඇගේ සුළු මව සහ සුළු සහෝදරියන් ඇයට එතරම් හොඳ නැති නිසා",
                "ඇයට කුමාරයා විශ්මයට පත් කිරීමට අවශ්‍ය නිසා",
                "එයාට වෙන කරන්න දෙයක් නැති නිසා",
              ],
              correctAnswer:
                "ඇගේ සුළු මව සහ සුළු සහෝදරියන් ඇයට එතරම් හොඳ නැති නිසා",
            },
            {
              questionId: 2,
              question: "සින්ඩරෙල්ලාගේ බල්ලා ඇයට දැනෙන්නේ කෙසේද?",
              options: ["ආදරය", "අමනාප", "බය", "කම්මැලි"],
              correctAnswer: "ආදරය",
            },
            {
              questionId: 3,
              question: "පින්තූරයේ සින්ඩරෙල්ලා ජීවත් වන්නේ කොහේද?",
              options: ["මාලිගාවක", "ගෘහයක", "වනාන්තරයක", "ගමක"],
              correctAnswer: "ගෘහයක",
            },
            {
              questionId: 4,
              question: "කතාවේ සින්ඩරෙල්ලා සිහින දකින්නේ කුමක්ද?",
              options: [
                "පන්දුවට යනවා",
                "කුමරියක් වීම",
                "ලෝක සංචාරය",
                "ඉහත සියල්ලම",
              ],
              correctAnswer: "ඉහත සියල්ලම",
            },
            {
              questionId: 5,
              question:
                "කතාවේදී සින්ඩරෙල්ලාගේ සුළු සහෝදරියන් ඇයට සලකන්නේ කෙසේද?",
              options: [
                "ඔවුන් ඇයට කරුණාවන්ත හා මෘදුයි",
                "ඔවුන් ඇයට නපුරු සහ රළු ය",
                "ඔවුන් ඇයට උපකාර සහ සහයෝගය දක්වයි",
                "ඔවුන් ඇය සමඟ විහිලු සහ සෙල්ලක්කාර",
              ],
              correctAnswer: "ඔවුන් ඇයට නපුරු සහ රළු ය",
            },
          ],
        },
      },
      {
        imageId: cinderellaStoryImages.cinderellaImage2,
        passageId: 2,
        passageContent:
          "එක් අව්ව සහිත දිනක, මහා බෝලයක් ගැන රජ මාලිගයෙන් ආරංචියක් ආවා. හැමෝටම ආරාධනා කළා, සින්ඩරෙල්ලාගේ සුළු සහෝදරියන්ට පවා. ඔවුන් ඉතා උද්යෝගිමත් වී, විසිතුරු ඇඳුම් තෝරාගෙන ඔවුන්ගේ නැටුම් පුරුදු පුහුණු කළා. නමුත් දුප්පත් සින්ඩරෙල්ලාට යන්න දුන්නේ නැහැ. , එය ඇයව ගොඩක් දුකට පත් කළා.",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "රාජ මාලිගාවේ මොකද වෙන්නේ?",
              options: [
                "මහා බෝලයක්",
                "විනෝද චාරිකාවක්",
                "පෙළපාලියක්",
                "උපන් දින සාදයක්",
              ],
              correctAnswer: "මහා බෝලයක්",
            },
            {
              questionId: 2,
              question: "මහා පන්දුවට ආරාධනා කළේ කවුද?",
              options: [
                "සින්ඩරෙල්ලා පමණි",
                "කුඩා සහෝදරියන් පමණයි",
                "හැමෝම",
                "කිසිවෙකු නැත",
              ],
              correctAnswer: "හැමෝම",
            },
            {
              questionId: 3,
              question: "බෝලයට නොයෑම ගැන සින්ඩරෙල්ලාට දැනුණේ කෙසේද?",
              options: ["සතුටුයි", "උද්දීපනයයි", "දුකයි", "කෝපයි"],
              correctAnswer: "දුකයි",
            },
          ],
          medium: [
            {
              questionId: 1,
              question: "සින්ඩරෙල්ලාගේ සුළු සහෝදරියන් කලබල වූයේ ඇයි?",
              options: [
                "ඔවුන් විනෝද චාරිකාවක් යමින් සිටියා",
                "ඔවුන් පන්දුවට යමින් සිටියා",
                "ඔවුන් පාසල් යමින් සිටියා",
                "ඔවුන් නිවාඩුවක් ගත කරමින් සිටියා",
              ],
              correctAnswer: "ඔවුන් පන්දුවට යමින් සිටියා",
            },
            {
              questionId: 2,
              question: "සින්ඩරෙල්ලාගේ සුළු සහෝදරියන් දින ගත කළේ කුමක්ද?",
              options: [
                "පොත් කියවනවා",
                "ක්‍රීඩා කිරීම",
                "විසිතුරු ඇඳුම් තෝරා ගැනීම",
                "ඉවුම් පිහුම්",
              ],
              correctAnswer: "විසිතුරු ඇඳුම් තෝරා ගැනීම",
            },
            {
              questionId: 3,
              question: "සින්ඩරෙල්ලාට පන්දුවට යාමට ඉඩ නොදුන්නේ ඇයි?",
              options: [
                "එයාට යන්න ඕන උනේ නෑ",
                "ඇයට වෙනත් සැලසුම් තිබුණා",
                "ඇගේ සුළු සහෝදරියන් ඇයට ආරාධනා කළේ නැහැ",
                "ඒක කතාවේ සඳහන් වෙලා නෑ",
              ],
              correctAnswer: "ඇගේ සුළු සහෝදරියන් ඇයට ආරාධනා කළේ නැහැ",
            },
          ],
        },
      },
      {
        imageId: cinderellaStoryImages.cinderellaImage3,
        passageId: 3,
        passageContent:
          "ඉන්පසු, ඉන්ද්‍රජාලික දෙයක් සිදු විය! දිලිසෙන ඇඳුමක්, දිදුලන යෂ්ටියක් සහ මැජික් දූවිලි ඉසින ලද ලස්සන සුරංගනාවියක් පෙනී සිටියාය. ඇය සින්ඩරෙල්ලාගේ සාමාන්‍ය ඇඳුම විශිෂ්ට ගවුමක් බවටත්, වට්ටක්කා මීයන් විසින් ඇද ගන්නා ලද විස්මිත කරත්තයක් බවටත් පත් කළාය. අශ්වයන් බවට!",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "සින්ඩරෙල්ලාට උදව් කිරීමට පෙනී සිටියේ කවුද?",
              options: ["සුරංගනාවක්", "රැජිනක්", "මායාකාරියක්", "කුමරියක්"],
              correctAnswer: "සුරංගනාවක්",
            },
            {
              questionId: 2,
              question: "සුරංගනාවියගේ අතේ තිබුණේ කුමක්ද?",
              options: ["පොතක්", "දිළිසෙන සැරයටියක්", "මලක්", "කඩුවක්"],
              correctAnswer: "දිළිසෙන සැරයටියක්",
            },
            {
              questionId: 3,
              question:
                "සුරංගනාවිය සින්ඩරෙල්ලාගේ සරල ඇඳුම් බවට පත් කළේ කුමක්ද?",
              options: [
                "විශිෂ්ට ගවුමක්",
                "වට්ටක්කා",
                "දිළිසෙන සැරයටියක්",
                "මලක්",
              ],
              correctAnswer: "විශිෂ්ට ගවුමක්",
            },
          ],
          medium: [
            {
              questionId: 1,
              question:
                "වට්ටක්කා කරත්තයක් බවට පත් කිරීමට සුරංගනාවිය භාවිතා කළේ කුමක්ද?",
              options: ["මැජික් දූවිලි", "දිළිසෙන සැරයටියක්", "පොතක්", "මල්"],
              correctAnswer: "මැජික් දූවිලි",
            },
            {
              questionId: 2,
              question: "මීයන් බවට පත් වූයේ කුමක්ද?",
              options: ["කරත්තය", "අශ්වයන්", "වට්ටක්කා", "ඇඳුම්"],
              correctAnswer: "අශ්වයන්",
            },
            {
              questionId: 3,
              question: "ඇයගේ ඇඳුම් වෙනස් වූ පසු සින්ඩරෙල්ලාට දැනුණේ කෙසේද?",
              options: ["දුකයි", "කෝපයි", "සතුටුයි", "කම්මැලියි"],
              correctAnswer: "සතුටුයි",
            },
          ],
        },
      },
      {
        imageId: cinderellaStoryImages.cinderellaImage4,
        passageId: 4,
        passageContent:
          "සින්ඩරෙල්ලා රාජකීය බෝලයට පැමිණ කඩවසම් කුමාරයා හමු විය. ඔවුන් දිලිසෙන තරු යට නටමින් කැරකෙමින් සිටියහ. නමුත් සුරංගනාවිය ඇයට අනතුරු ඇඟවූයේ මැජික් මධ්‍යම රාත්‍රිය දක්වා පමණක් පවතිනු ඇති බවයි. මාලිගාවේ විශාල ඔරලෝසුව 'ඩිං-ඩොං' සාදන විට. දොළොස් වතාවක් හඬ නඟා, සින්ඩරෙල්ලාට කඩිමුඩියේ පිටව යාමට සිදු විය. ඇය වේගයෙන් දිව යන විට වීදුරු සෙරෙප්පුවක් ඉතිරි කළාය.",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "Cinderella පන්දුවේදී හමුවූයේ කවුද?",
              options: ["කුමාරයා", "සුරංගනා", "මායාකාරිය", "පූසා"],
              correctAnswer: "කුමාරයා",
            },
            {
              questionId: 2,
              question: "සින්ඩරෙල්ලා ඉතිරි කළේ කුමක්ද?",
              options: ["සෙරෙප්පු", "පොත", "වට්ටක්කා", "ඇඳුම"],
              correctAnswer: "සෙරෙප්පු",
            },
            {
              questionId: 3,
              question: "ඇයි සින්ඩරෙල්ලාට හදිස්සියේ යන්න වුණේ?",
              options: ["මැජික් අවසානය", "බඩගිනි", "නිදිමත", "කම්මැලි"],
              correctAnswer: "මැජික් අවසානය",
            },
          ],
          medium: [
            {
              questionId: 1,
              question: "සුරංගනාවිය සින්ඩරෙල්ලාට අනතුරු ඇඟවූයේ කුමක් ගැනද?",
              options: ["මධ්යම රාත්රිය", "නැටුම්", "කුමාරයා", "වට්ටක්කා"],
              correctAnswer: "මධ්යම රාත්රිය",
            },
            {
              questionId: 2,
              question: "ඔරලෝසුව නිකුත් කළ ශබ්දය කුමක්ද?",
              options: ["ඩිං-ඩොං", "ටික්-ටොක්", "චිර්ප්", "මියව්"],
              correctAnswer: "ඩිං-ඩොං",
            },
            {
              questionId: 3,
              question: "සින්ඩරෙල්ලාට පිටවීමට සිදු වූයේ කීයටද?",
              options: ["මධ්‍යම රාත්‍රිය", "දහවල්", "උදෑසන", "සන්ධ්‍යාව"],
              correctAnswer: "මධ්‍යම රාත්‍රිය",
            },
          ],
        },
      },
      {
        imageId: cinderellaStoryImages.cinderellaImage5,
        passageId: 5,
        passageContent:
          "කුමාරයා වීදුරු සෙරෙප්පුව සොයාගෙන එහි හිමිකරු සොයා ගියේය. සින්ඩරෙල්ලා එය උත්සාහ කළ විට එය හොඳින් ගැලපේ! ඇය අතිශයින් සතුටට පත් විය. කුමාරයා තමා සොයමින් සිටියේ ඇය බව දැන සිටියේය. ඔවුන් විවාහ වූයේ උත්කර්ෂවත් උත්සවයකින් සහ සින්ඩරෙල්ලාගේ සුළු මව සහ සුළු සහෝදරියන් බියට පත් වූහ.",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "කවුද වීදුරු සෙරෙප්පුව හොයාගත්තේ?",
              options: ["කුමාරයා", "සින්ඩරෙල්ලා", "සුරංගනා", "මවුස්"],
              correctAnswer: "කුමාරයා",
            },
            {
              questionId: 2,
              question:
                "සින්ඩරෙල්ලා වීදුරු සෙරෙප්පුව මත උත්සාහ කළ විට සිදු වූයේ කුමක්ද?",
              options: [
                "එය හොඳින් ගැලපේ",
                "කැඩුණා",
                "එය ඉතා විශාල විය",
                "එය අතුරුදහන් විය",
              ],
              correctAnswer: "එය හොඳින් ගැලපේ",
            },
            {
              questionId: 3,
              question:
                "වීදුරු සෙරෙප්පුව හොඳින් ගැළපෙන විට සින්ඩරෙල්ලාට දැනුණේ කෙසේද?",
              options: ["අතිශයින්", "කෝප", "දුක", "ව්‍යාකූල"],
              correctAnswer: "අතිශයින්",
            },
            {
              questionId: 4,
              question: "මහා උත්සවයකදී සින්ඩරෙල්ලා විවාහ වූයේ කාවද?",
              options: ["කුමාරයා", "සුරංගනා", "මවුස්", "කුඩම්මා"],
              correctAnswer: "කුමාරයා",
            },
            {
              questionId: 5,
              question: "සින්ඩරෙල්ලා විවාහ වූ විට ඇයට දැනුණේ කෙසේද?",
              options: ["අතිශයින්", "කෝප", "දුක", "ව්‍යාකූල"],
              correctAnswer: "අතිශයින්",
            },
          ],
          medium: [
            {
              questionId: 1,
              question:
                "වීදුරු සෙරෙප්පුවේ හිමිකරු සින්ඩරෙල්ලා බව දැනගත් කුමාරයා කුමක් කළේද?",
              options: [
                "විවාහ වුණා",
                "ආපහු මාලිගාවට ගියා",
                "සාදයකට ගියා",
                "තවත් සපත්තු මිලදී ගත්තා",
              ],
              correctAnswer: "විවාහ වුණා",
            },
            {
              questionId: 2,
              question:
                "සින්ඩරෙල්ලා විවාහ වූ විට ඇගේ සුළු මව සහ සුළු සහෝදරියන්ගේ ප්‍රතිචාරය කුමක්ද?",
              options: ["සතුටු", "ඊර්ෂ්‍යාව", "දුක", "උද්දීපනය"],
              correctAnswer: "ඊර්ෂ්‍යාව",
            },
            {
              questionId: 3,
              question:
                "විවාහයෙන් පසු සින්ඩරෙල්ලා සහ කුමාරයා ජීවත් වූයේ කෙසේද?",
              options: [
                "සදහටම සතුටින්",
                "අසතුටුදායකයි",
                "වට්ටක්කා ගෙඩියක",
                "කුළුණක",
              ],
              correctAnswer: "සදහටම සතුටින්",
            },
          ],
        },
      },
    ],

    RapunzelStoryContent: [
      {
        imageId: RapunzelStoryImages.rapunzelImage1,
        passageId: 1,
        passageContent:
          "එක් කලෙක, වනාන්තරයේ ගැඹුරින් සැඟවී ඇති උස් කුළුණක, රපුන්සෙල් නම් රූමත් ගැහැණු ළමයෙකු ජීවත් විය, ඔබට සිතාගත නොහැකි දීප්තිමත්, දිගු කෙස් කළඹක් ඇයට හිමි විය, නමුත් නපුරු මායාකාරියක් නිසා ඇය කිසි විටෙකත් කුළුණෙන් පිටතට පය තබා නොතිබුණි. ඇයව එහි සිරකර තැබුවා.",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "රපුන්සල්ගේ කුළුණේ සිටි මිතුරා කවුද?",
              options: ["මායාකාරිය", "කුමාරයා", "මකරා", "සුරංගනා"],
              correctAnswer: "මායාකාරිය",
            },
            {
              questionId: 2,
              question: "රපුන්සෙල් ඇගේ මුළු ජීවිත කාලයම ජීවත් වූයේ කොහේද?",
              options: ["කුළුණ", "කාසල්", "ගම", "වනාන්තර"],
              correctAnswer: "කුළුණ",
            },
            {
              questionId: 3,
              question: "ඇයි රපුන්සල්ට කුළුණෙන් පිටවෙන්න බැරි වුණේ?",
              options: ["නපුරු මායාකාරිය", "මැජික්", "කුමාරයා", "නැටුම්"],
              correctAnswer: "නපුරු මායාකාරිය",
            },
            {
              questionId: 4,
              question: "Rapunzel ගේ කොණ්ඩයේ විශේෂත්වය කුමක්ද?",
              options: ["දිගු", "කෙටි", "රතු", "කැරලි"],
              correctAnswer: "දිගු",
            },
            {
              questionId: 5,
              question: "රපුන්සල් කවදාවත් එලියට ගිහින් තියෙනවද?",
              options: ["නෑ", "ඔව්", "සමහර වෙලාවට", "සැමවිටම"],
              correctAnswer: "නෑ",
            },
          ],
          medium: [
            {
              questionId: 1,
              question: "Rapunzel කුළුණ තුළ කිරීමට කැමති වූයේ කුමක්ද?",
              options: ["කියවන්න", "සෙල්ලම් කරන්න", "නිදාගන්න", "අඬන්න"],
              correctAnswer: "කියවන්න",
            },
            {
              questionId: 2,
              question: "මායාකාරිය රපුන්සෙල්ගේ කුළුණට ළඟා වූයේ කෙසේද?",
              options: ["නැගීම", "පියාඹීම", "මැජික්", "ඉණිමඟ"],
              correctAnswer: "නැගීම",
            },
            {
              questionId: 3,
              question: "Rapunzel කුළුණේ රැඳී සිටියේ ඇයි?",
              options: ["නපුරු මායාකාරිය", "කුමාරයා", "බිය", "විනෝදය"],
              correctAnswer: "නපුරු මායාකාරිය",
            },
            {
              questionId: 4,
              question: "Rapunzel ගේ කොණ්ඩය විස්තර කරන්න.",
              options: ["දිගු", "කෙටි", "රතු", "කැරලි"],
              correctAnswer: "දිගු",
            },
            {
              questionId: 5,
              question: "රපුන්සල් කවදාවත් සෙල්ලම් කරන්න එලියට ගිහින් තියෙනවද?",
              options: ["නෑ", "ඔව්", "සමහර වෙලාවට", "සැමවිටම"],
              correctAnswer: "නෑ",
            },
          ],
          hard: [],
        },
      },
      {
        imageId: RapunzelStoryImages.rapunzelImage2,
        passageId: 2,
        passageContent:
          "රපුන්සෙල්ගේ කුළුණේ සිටි එකම සමාගම ඇයව ඇති දැඩි කළ මායාකාරියයි. මායාකාරිය රපුන්සෙල්ගේ දිගු කෙස් මතට නැඟී කුළුණට ළඟා වනු ඇත. රපුන්සල් කාලය ගත කිරීම සඳහා පොත් කියවමින් සහ ගීත ගායනා කරමින් ඇගේ දින ගත කළාය.",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "කවුද කුළුණේ රපුන්සෙල්ව බලන්න ආවේ?",
              options: ["මායාකාරිය", "කුමාරයා", "මකරා", "සුරංගනා"],
              correctAnswer: "මායාකාරිය",
            },
            {
              questionId: 2,
              question: "මායාකාරිය රපුන්සෙල්ගේ කුළුණට ළඟා වූයේ කෙසේද?",
              options: ["නැගීම", "පියාඹීම", "මැජික්", "ඉණිමඟ"],
              correctAnswer: "නැගීම",
            },
            {
              questionId: 3,
              question: "රපුන්සල් කුළුණේ මොනවද කළේ?",
              options: ["කියවන්න", "සෙල්ලම් කරන්න", "නිදාගන්න", "අඬන්න"],
              correctAnswer: "කියවන්න",
            },
            {
              questionId: 4,
              question: "රපුන්සල් කාලය ගත කළේ කෙසේද?",
              options: ["කියවීම", "සෙල්ලම් කිරීම", "නිදාගැනීම", "හැඬීම"],
              correctAnswer: "කියවීම",
            },
            {
              questionId: 5,
              question: "රපුන්සෙල්ගේ කොණ්ඩයේ විශේෂත්වය කුමක්ද?",
              options: ["දිගු", "කෙටි", "රතු", "කැරලි"],
              correctAnswer: "දිගු",
            },
          ],
          medium: [
            {
              questionId: 1,
              question: "ඇයි රපුන්සල් පොත් කියවමින් දවස් ගත කළේ?",
              options: ["ආදරය", "කම්මැලිකම", "මැජික්", "බිය"],
              correctAnswer: "කම්මැලිකම",
            },
            {
              questionId: 2,
              question: "මායාකාරිය කුළුණට ළඟා වූයේ කෙසේද?",
              options: ["මැජික්", "නැගීම", "පියාඹීම", "ඉණිමඟ"],
              correctAnswer: "නැගීම",
            },
            {
              questionId: 3,
              question: "රපුන්සල් මොනවද කරන්න කැමති?",
              options: ["කියවන්න", "සෙල්ලම් කරන්න", "නිදාගන්න", "අඬන්න"],
              correctAnswer: "කියවන්න",
            },
            {
              questionId: 4,
              question: "කාලය ගත කිරීමට රපුන්සල් කළේ කුමක්ද?",
              options: ["පොත් කියවනවා", "ගීත ගායනා", "ක්‍රීඩා කිරීම", "නිදි"],
              correctAnswer: "පොත් කියවනවා",
            },
            {
              questionId: 5,
              question: "රපුන්සෙල්ගේ කොණ්ඩය විස්තර කරන්න.",
              options: ["දිගු", "කෙටි", "රතු", "කැරලි"],
              correctAnswer: "දිගු",
            },
          ],
          hard: [],
        },
      },
      {
        imageId: RapunzelStoryImages.rapunzelImage3,
        passageId: 3,
        passageContent:
          "දවසක්, නිර්භීත කුමාරයෙකුට රපුන්සෙල් වනාන්තරය හරහා යද්දී ඔහුගේ ලස්සන ගායනය ඇසුණි. ඔහු කුළුණ සොයා ගත් නමුත් රපුන්සෙල් වෙත ළඟා වන්නේ කෙසේදැයි නොදැන සිටියේය. ඔහු රහස ඉගෙන ගත හැකිදැයි බලා සිටීමට තීරණය කළේය.",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "වනාන්තරයේ රපුන්සෙල්ගේ ගායනය ඇසුවේ කවුද?",
              options: ["කුමාරයා", "මායාකාරිය", "මකරා", "සුරංගනා"],
              correctAnswer: "කුමාරයා",
            },
            {
              questionId: 2,
              question: "කුමාරයා රපුන්සෙල්ගේ කුළුණ සොයාගත්තේ කොහෙන්ද?",
              options: ["වනාන්තරය", "කාසල්", "ගම", "ගඟ"],
              correctAnswer: "වනාන්තරය",
            },
            {
              questionId: 3,
              question: "කුමාරයා කුමක් කිරීමට තීරණය කළාද?",
              options: ["ඉන්න", "පිටවෙන්න", "නගින්න", "ගායනා කරන්න"],
              correctAnswer: "ඉන්න",
            },
            {
              questionId: 4,
              question: "කුමාරයා ඉගෙන ගන්න බලාපොරොත්තු වුණේ මොනවද?",
              options: ["රහස", "ගීතය", "මැජික්", "නැටුම්"],
              correctAnswer: "රහස",
            },
            {
              questionId: 5,
              question: "කුමාරයා කැලේ නැවතුනේ ඇයි?",
              options: [
                "ගායනය අසන්න",
                "මිතුරන් හමුවන්න",
                "ආහාර සොයන්න",
                "නිදාගන්න",
              ],
              correctAnswer: "ගායනය අසන්න",
            },
          ],
          medium: [
            {
              questionId: 1,
              question: "රපුන්සල්ගේ කුළුණ වනාන්තරයේ තිබී සොයාගත්තේ කවුද?",
              options: ["කුමාරයා", "මායාකාරිය", "මකරා", "සුරංගනා"],
              correctAnswer: "කුමාරයා",
            },
            {
              questionId: 2,
              question: "කුමාරයා බලා සිටීමට තීරණය කළේ කොහේද?",
              options: ["වනාන්තරය", "කාසල්", "ගම", "ගඟ"],
              correctAnswer: "වනාන්තරය",
            },
            {
              questionId: 3,
              question:
                "කුමාරයා රපුන්සෙල් ගැන ඉගෙන ගන්න බලාපොරොත්තු වුණේ මොකක්ද?",
              options: ["රහස", "ගීතය", "මැජික්", "නැටුම්"],
              correctAnswer: "රහස",
            },
            {
              questionId: 4,
              question: "කුමාරයා කැලේ නැවතුනේ ඇයි?",
              options: [
                "ගායනය අසන්න",
                "මිතුරන් හමුවන්න",
                "ආහාර සොයන්න",
                "නිදාගන්න",
              ],
              correctAnswer: "ගායනය අසන්න",
            },
            {
              questionId: 5,
              question: "රපුන්සල් කුළුණේ මොනවද කළේ?",
              options: ["කියවන්න", "සෙල්ලම් කරන්න", "ගායනය", "නටන්න"],
              correctAnswer: "ගායනය",
            },
          ],
          hard: [],
        },
      },
      {
        imageId: RapunzelStoryImages.rapunzelImage4,
        passageId: 4,
        passageContent:
          "කුමාරයා ඉක්මනින් මායාකාරියගේ රහස සොයා ගත්තේය. ඔහු රපුන්සෙල්ට කතා කළේය, ඇය ඇගේ දිගු රන්වන් හිසකෙස් පහත් කළාය. කුමාරයා නැග්ගා, ඔවුන් ආදරයෙන් බැඳුණා. නමුත් මායාකාරිය එය දැනගත් අතර ඉතා කෝපයට පත් විය.",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "මායාකාරියගේ රහස සොයාගත්තේ කවුද?",
              options: ["කුමාරයා", "මායාකාරිය", "මකරා", "සුරංගනා"],
              correctAnswer: "කුමාරයා",
            },
            {
              questionId: 2,
              question: "කුමාරයා රපුන්සෙල්ට කතා කළේ කුමක්ද?",
              options: ["මැජික් වචන", "ඇගේ නම", "උදව්", "අකුරු කරන්න"],
              correctAnswer: "ඇගේ නම",
            },
            {
              questionId: 3,
              question: "රපුන්සල් කුමරුට ඇය වෙත ළඟා වීමට උදව් කළේ කෙසේද?",
              options: [
                "පහළ හිසකෙස්",
                "ඔහු වෙත පියාසර කළා",
                "භාවිතා කළ මැජික්",
                "පහළට නැග්ගා",
              ],
              correctAnswer: "පහළ හිසකෙස්",
            },
            {
              questionId: 4,
              question: "කුමාරයා සහ රපුන්සෙල් මුණගැසුණු විට සිදු වූයේ කුමක්ද?",
              options: [
                "ආදරය කළා",
                "රණ්ඩු වුණා",
                "පැනලා ගියා",
                "ගීත ගායනා කළා",
              ],
              correctAnswer: "ආදරය කළා",
            },
            {
              questionId: 5,
              question: "ඇයි මායාකාරිය තරහ වුනේ?",
              options: [
                "කොණ්ඩය නැති වුනා",
                "හඳුනා ගත්තා",
                "කුමාරයාව දැක්කා",
                "නටන්න ඕන වුනා",
              ],
              correctAnswer: "සොයාගත්තා",
            },
          ],
          medium: [
            {
              questionId: 1,
              question: "මායාකාරියගේ රහස සොයාගත්තේ කවුද?",
              options: ["මායාකාරිය", "කුමාරයා", "මකරා", "සුරංගනා"],
              correctAnswer: "කුමාරයා",
            },
            {
              questionId: 2,
              question: "රපුන්සල් කුමරුට ඇය වෙත ළඟා වීමට උදව් කළේ කෙසේද?",
              options: [
                "පහළ හිසකෙස්",
                "ඔහු වෙත පියාසර කළා",
                "භාවිතා කළ මැජික්",
                "පහළට නැග්ගා",
              ],
              correctAnswer: "පහළ හිසකෙස්",
            },
            {
              questionId: 3,
              question: "කුමාරයා සහ රපුන්සෙල් මුණගැසුණු විට සිදු වූයේ කුමක්ද?",
              options: [
                "ආදරය කළා",
                "රණ්ඩු වුණා",
                "පැනලා ගියා",
                "ගීත ගායනා කළා",
              ],
              correctAnswer: "ආදරය කළා",
            },
            {
              questionId: 4,
              question: "ඇයි මායාකාරියට තරහ ගියේ?",
              options: [
                "කොණ්ඩය නැති වුනා",
                "හඳුනා ගත්තා",
                "කුමාරයාව දැක්කා",
                "නටන්න ඕන වුනා",
              ],
              correctAnswer: "හඳුනා ගත්තා",
            },
            {
              questionId: 5,
              question: "රපුන්සෙල් කුමරුට උදව් කිරීමට කළේ කුමක්ද?",
              options: [
                "ගීත ගායනා කළා",
                "පහළ හිසකෙස්",
                "භාවිතා කළ මැජික්",
                "ඔහු වෙත පියාසර කළා",
              ],
              correctAnswer: "පහළ හිසකෙස්",
            },
          ],
          hard: [],
        },
      },
      {
        imageId: RapunzelStoryImages.rapunzelImage5,
        passageId: 5,
        passageContent:
          "මායාකාරයා මන්ත්‍රයක් කරලා රපුන්සෙල්ව ඈතට යැව්වා. කුමාරයාගේ හිත රිදුණා. ඔහු රපුන්සල් සොයා ගොස් අවසානයේ ඇයව සොයා ගත්තා. ඔවුන්ගේ ආදරය කොතරම් ශක්තිමත්ද යත් එය මායාකාරියගේ මන්ත්‍රය බිඳ දමා ඔවුන් සතුටින් සදහටම ජීවත් විය. එතැනින් අවසන් වේ. Rapunzel පිළිබඳ අපගේ ඉන්ද්‍රජාලික කතාව!",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "රපුන්සෙල්ට මන්ත්‍රයක් කළේ කවුද?",
              options: ["මායාකාරිය", "කුමාරයා", "මකරා", "සුරංගනා"],
              correctAnswer: "මායාකාරිය",
            },
            {
              questionId: 2,
              question: "කුමාරයා රපුන්සෙල්ව සෙව්වේ ඇයි?",
              options: ["ආදරය", "මැජික්", "බිය", "ත්රාසජනක"],
              correctAnswer: "Love",
            },
            {
              questionId: 3,
              question: "කුමාරයා රපුන්සෙල්ව හොයාගත්තම මොකද වුනේ?",
              options: ["ආදරය කළා", "රණ්ඩු වුණා", "පලා ගියා", "ඇඬුනා"],
              correctAnswer: "ආදරය කළා",
            },
            {
              questionId: 4,
              question: "ඔවුන්ගේ ආදරය මායාකාරියගේ මායාවට කළේ කුමක්ද?",
              options: [
                "කැඩුණා",
                "එය ශක්තිමත් කළා",
                "වෙනස් කළා",
                "කිසිවක් නැත",
              ],
              correctAnswer: "කැඩුණා",
            },
            {
              questionId: 5,
              question: "රපුන්සල් සහ කුමාරයා සතුටින් ජීවත් වූයේ කෙසේද?",
              options: ["සෑමදාම", "කනගාටුදායකයි", "තනියම", "කුළුණේ"],
              correctAnswer: "සෑමදාම",
            },
          ],
          medium: [
            {
              questionId: 1,
              question: "රපුන්සෙල්ට මන්ත්‍රයක් කළේ කවුද?",
              options: ["මායාකාරිය", "කුමාරයා", "මකරා", "සුරංගනා"],
              correctAnswer: "මායාකාරිය",
            },
            {
              questionId: 2,
              question: "කුමාරයා රපුන්සෙල්ව සෙව්වේ ඇයි?",
              options: ["ආදරය", "මැජික්", "බිය", "ත්රාසජනක"],
              correctAnswer: "ආදරය",
            },
            {
              questionId: 3,
              question: "කුමාරයා රපුන්සෙල්ව හොයාගත්තම මොකද වුණේ?",
              options: ["ආදරය කළා", "රණ්ඩු වුණා", "පලා ගියා", "ඇඬුවා"],
              correctAnswer: "ආදරය කළා",
            },
            {
              questionId: 4,
              question: "ඔවුන්ගේ ආදරය මායාකාරියගේ මායාවට කළේ කුමක්ද?",
              options: [
                "කැඩුණා",
                "එය ශක්තිමත් කළා",
                "වෙනස් කළා",
                "කිසිවක් නැත",
              ],
              correctAnswer: "කැඩුණා",
            },
            {
              questionId: 5,
              question: "රපුන්සල් සහ කුමාරයා සතුටින් ජීවත් වූයේ කෙසේද?",
              options: ["කවදාවත් පසු", "කනගාටුදායක", "තනිව", "කුළුණේ"],
              correctAnswer: "කවදාවත් පසු",
            },
          ],
          hard: [],
        },
      },
    ],
    HerculesStoryContent: [
      {
        imageId: HerculesStoryImages.herculesImage1,
        passageId: 1,
        passageContent:
          "බොහෝ කලකට පෙර පුරාණ ග්‍රීසියේ හර්කියුලිස් නම් ළදරුවෙක් සිටියේය. ඔහු දෙවිවරුන්ගේ රජු වූ සියුස්ගේ පුත්‍රයා නිසා ඔහු සාමාන්‍ය ළදරුවෙක් නොවීය. නමුත් නපුරු මායාකාරියක් ඔහුව රවටා ඔහුගේ සැබෑ අනන්‍යතාවය අමතක කළේය.",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "කතාව කවුරු ගැනද?",
              options: ["හර්කියුලිස්", "සියුස්", "සූනියම්කාරියක්", "රජෙක්"],
              correctAnswer: "හර්කියුලිස්",
            },
            {
              questionId: 2,
              question: "හර්කියුලිස්ගේ පියා කවුද?",
              options: ["රජෙක්", "සියුස්", "සූනියම්කාරියක්", "බබා"],
              correctAnswer: "සියුස්",
            },
            {
              questionId: 3,
              question: "හර්කියුලිස් සාමාන්‍ය දරුවෙක්ද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 4,
              question: "ඔහු සියුස්ගේ පුත්‍රයා බව හර්කියුලිස් දැන සිටියාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 5,
              question: "හර්කියුලිස්ව රැවැට්ටුවේ කවුද?",
              options: ["රජෙක්", "සියුස්", "සූනියම්කාරියක්", "බබා"],
              correctAnswer: "සූනියම්කාරියක්",
            },
            {
              questionId: 6,
              question: "හර්කියුලිස් ජීවත් වූයේ කොහේද?",
              options: ["පුරාණ ග්රීසියේ", "රෝමයේ", "ඊජිප්තුවේ", "පර්සියාවේ"],
              correctAnswer: "පුරාණ ග්රීසියේ",
            },
            {
              questionId: 7,
              question: "සියුස් දෙවියෙක්ද මිනිසෙක්ද?",
              options: ["දෙවියන්", "මිනිස්", "දෙකම", "කිසිවක් නැත"],
              correctAnswer: "දෙවියන්",
            },
          ],
          medium: [
            {
              questionId: 1,
              question: "ඇයි හර්කියුලිස් සාමාන්‍ය ළදරුවෙක් නොවුනේ?",
              options: [
                "ඔහු රජෙකු වූ නිසා",
                "මොකද ඔහු දෙවිවරුන්ගේ රජු වූ සියුස්ගේ පුත්‍රයා",
                "මොකද ඔහු මායාකාරියක්",
                "මොකද එයා බබෙක්",
              ],
              correctAnswer: "මොකද ඔහු දෙවිවරුන්ගේ රජු වූ සියුස්ගේ පුත්‍රයා",
            },
            {
              questionId: 2,
              question: "නපුරු මායාකාරිය හර්කියුලිස්ට කළේ කුමක්ද?",
              options: [
                "ඇය ඔහුව රජ කළා",
                "ඇය ඔහුට ඔහුගේ සැබෑ අනන්‍යතාවය අමතක කළා",
                "ඇය ඔහුව මායාකාරියක් කළා",
                "ඇය ඔහුව බබෙක් කළා",
              ],
              correctAnswer: "ඇය ඔහුට ඔහුගේ සැබෑ අනන්‍යතාවය අමතක කළා",
            },
            {
              questionId: 3,
              question: "හර්කියුලිස්ට ළදරුවෙකු ලෙස දැනුණේ කෙසේද?",
              options: [
                "ඔහු රජෙකු මෙන් දැනුණා",
                "ඔහුට සියුස් වගේ දැනුණා",
                "ඔහුගේ සැබෑ අනන්‍යතාවය නොදන්නා නිසා ඔහුට වෙනස් බවක් දැනුනි",
                "ඔහු මන්තර ගුරුකම් කරන කෙනෙක් වගේ",
              ],
              correctAnswer:
                "ඔහුගේ සැබෑ අනන්‍යතාවය නොදන්නා නිසා ඔහුට වෙනස් බවක් දැනුනි",
            },
            {
              questionId: 4,
              question: "හර්කියුලිස්ගේ පියාගේ විශේෂත්වය කුමක්ද?",
              options: [
                "ඔහු රජෙක් විය",
                "ඔහු දෙවියන්ගේ රජ විය",
                "ඔහු මායාකාරියක්",
                "ඔහු බබෙක් විය",
              ],
              correctAnswer: "ඔහු දෙවියන්ගේ රජ විය",
            },
            {
              questionId: 5,
              question: "ඇයි හර්කියුලිස්ට ඔහු සියුස්ගේ පුත්‍රයා බව මතක නැත්තේ?",
              options: [
                "ඔහු රජෙකු වූ නිසා",
                "නපුරු මායාකාරියක් ඔහුව රැවටූ නිසා",
                "මොකද ඔහු මායාකාරියක්",
                "මොකද එයා බබෙක්",
              ],
              correctAnswer: "නපුරු මායාකාරියක් ඔහුව රැවටූ නිසා",
            },
          ],
          hard: [],
        },
      },
      {
        imageId: HerculesStoryImages.herculesImage2,
        passageId: 2,
        passageContent:
          "හර්කියුලිස් හැදී වැඩෙන විට, ඔහු ඇදහිය නොහැකි තරම් ශක්තිමත් විය, නමුත් ඔහු ඒ මන්දැයි ඔහු දැන සිටියේ නැත. ඔහුට තම ගමේ අනෙක් අයට වඩා වෙනස් බවක් දැනුනි. එබැවින්, ඔහු ඇත්තටම කවුදැයි සොයා ගැනීමට සහ තමා සැබෑ වීරයෙකු බව ඔප්පු කිරීමට ගවේෂණයක යෙදී සිටියේය. ",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "හර්කියුලිස්ට අන් අයට වඩා වෙනස් බවක් දැනුණාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 2,
              question: "හර්කියුලිස් කුමක් කිරීමට තීරණය කළේද?",
              options: [
                "ගවේෂණයකට යන්න",
                "ඔහුගේ ගමේ ඉන්න",
                "දුර්වල වන්න",
                "සියල්ල අමතක කරන්න",
              ],
              correctAnswer: "ගවේෂණයකට යන්න",
            },
            {
              questionId: 3,
              question:
                "හර්කියුලිස් ඔහුගේ ගවේෂණයේදී සොයා ගැනීමට උත්සාහ කළේ කුමක්ද?",
              options: [
                "ඔහු ඇත්තටම කවුද සහ සැබෑ වීරයෙක් වන්නේ කෙසේද",
                "දුර්වල වන්නේ කෙසේද",
                "ඔහුගේ ගමේ ඉන්න හැටි",
                "සියල්ල අමතක කරන්නේ කෙසේද",
              ],
              correctAnswer: "ඔහු ඇත්තටම කවුද සහ සැබෑ වීරයෙක් වන්නේ කෙසේද",
            },
            {
              questionId: 4,
              question: "හර්කියුලිස් දුර්වලද ශක්තිමත්ද?",
              options: ["දුර්වල", "ශක්තිමත්", "නැත", "දෙකම"],
              correctAnswer: "ශක්තිමත්",
            },
            {
              questionId: 5,
              question: "හර්කියුලිස් ඔහුගේ ගමේ නැවතී සිටියාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "නෑ",
            },
          ],
          medium: [
            {
              questionId: 1,
              question:
                "හර්කියුලිස්ට තම ගමේ අන් අයට වඩා වෙනස් බවක් දැනුණේ ඇයි?",
              options: [
                "ඔහු ඇදහිය නොහැකි තරම් ශක්තිමත් සහ ඒ මන්දැයි නොදැන සිටි නිසා",
                "ඔහුට ගවේෂණයකට යාමට අවශ්‍ය වූ නිසා",
                "ඔහුට ඔහුගේ ගමේ සිටීමට අවශ්ය වූ නිසා",
                "ඔහුට දුර්වල වීමට අවශ්ය වූ නිසා",
              ],
              correctAnswer:
                "ඔහු ඇදහිය නොහැකි තරම් ශක්තිමත් සහ ඒ මන්දැයි නොදැන සිටි නිසා",
            },
            {
              questionId: 2,
              question: "හර්කියුලිස්ගේ ගවේෂණයේ අරමුණ කුමක්ද?",
              options: [
                "ඔහු සැබවින්ම කවුදැයි සොයා ගැනීමට සහ තමා සැබෑ වීරයෙකු බව ඔප්පු කිරීමට",
                "දුර්වල වීමට",
                "ඔහුගේ ගමේ ඉන්න",
                "සියල්ල අමතක කිරීමට",
              ],
              correctAnswer:
                "ඔහු සැබවින්ම කවුදැයි සොයා ගැනීමට සහ තමා සැබෑ වීරයෙකු බව ඔප්පු කිරීමට",
            },
            {
              questionId: 3,
              question:
                "ඔහුගේ ගමේ අනෙක් අය හා සසඳන විට හර්කියුලිස්ට දැනුණේ කෙසේද?",
              options: [
                "ඔහුට වෙනස් බවක් දැනුනි",
                "එයාටත් එහෙම හිතුනා",
                "ඔහු උසස් යැයි හැඟේ",
                "ඔහුට පහත් බවක් දැනුනි",
              ],
              correctAnswer: "ඔහුට වෙනස් බවක් දැනුනි",
            },
            {
              questionId: 4,
              question:
                "හර්කියුලිස් ඔහුගේ ගවේෂණයේදී ඔප්පු කිරීමට බලාපොරොත්තු වූයේ කුමක්ද?",
              options: [
                "ඔහු දුර්වල බව",
                "ඔහු සැබෑ වීරයෙක් බව",
                "ඔහුට ඔහුගේ ගමේ සිටිය හැකි බව",
                "ඔහුට සියල්ල අමතක කළ හැකි බව",
              ],
              correctAnswer: "ඔහු සැබෑ වීරයෙක් බව",
            },
          ],
          hard: [],
        },
      },
      {
        imageId: HerculesStoryImages.herculesImage3,
        passageId: 3,
        passageContent:
          "හර්කියුලිස් බොහෝ අභියෝගවලට මුහුණ දුන් අතර දරුණු රාක්ෂයන් පරාජය කිරීම සහ කළ නොහැකි ප්‍රහේලිකා විසඳීම වැනි ඇදහිය නොහැකි දස්කම් සිදු කළේය. මගදී, ඔහු මිතුරන් ඇති කර ගත් අතර නිර්භීතකම සහ කරුණාව පිළිබඳ වැදගත් පාඩම් ඉගෙන ගත්තේය.",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "හර්කියුලිස් ඔහුගේ ගවේෂණයේදී අභියෝගවලට මුහුණ දුන්නාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 2,
              question: "හර්කියුලිස් ඔහුගේ ගමනේදී මිතුරන් ඇති කර ගත්තාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 3,
              question: "හර්කියුලිස් ඔහුගේ ගවේෂණයේදී රාක්ෂයන් පරාජය කළාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 4,
              question: "හර්කියුලිස් ඔහුගේ ගමනේදී යමක් ඉගෙන ගත්තාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 5,
              question: "හර්කියුලිස් ඔහුගේ ගවේෂණයේදී ප්‍රහේලිකා විසඳුවාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
          ],
          medium: [
            {
              questionId: 1,
              question: "ඔහුගේ ගවේෂණයේදී හර්කියුලිස් කළේ කුමන ආකාරයේ දස්කම්ද?",
              options: [
                "ඔහු දරුණු රාක්ෂයන් පරාජය කර කළ නොහැකි ප්‍රහේලිකා විසඳුවේය",
                "ඔහු මිතුරන් ඇති කර ගත්තේය",
                "ඔහු නිර්භීතකම සහ කරුණාව ගැන ඉගෙන ගත්තා",
                "ඉහත සියල්ලම",
              ],
              correctAnswer:
                "ඔහු දරුණු රාක්ෂයන් පරාජය කර කළ නොහැකි ප්‍රහේලිකා විසඳුවේය",
            },
            {
              questionId: 2,
              question: "හර්කියුලිස් ඔහුගේ ගමනේදී ඉගෙනගත්තේ කුමක්ද?",
              options: [
                "නිර්භීතකම සහ කරුණාව පිළිබඳ වැදගත් පාඩම්",
                "රාක්ෂයන් පරාජය කරන්නේ කෙසේද",
                "ප්‍රහේලිකා විසඳන්නේ කෙසේද",
                "මිතුරන් ඇති කර ගන්නේ කෙසේද",
              ],
              correctAnswer: "නිර්භීතකම සහ කරුණාව පිළිබඳ වැදගත් පාඩම්",
            },
            {
              questionId: 3,
              question: "හර්කියුලිස් පරාජය කළේ මොන වගේ රාක්ෂයන්ද?",
              options: [
                "දරුණු රාක්ෂයන්",
                "මිත්රශීලී රාක්ෂයන්",
                "මනඃකල්පිත රාක්ෂයන්",
                "කුඩා රාක්ෂයන්",
              ],
              correctAnswer: "දරුණු රාක්ෂයන්",
            },
            {
              questionId: 4,
              question:
                "හර්කියුලිස් ඔහුගේ ගමනේදී ඉගෙන ගත් වැදගත් පාඩම් මොනවාද?",
              options: [
                "නිර්භීතකම සහ කරුණාව ගැන",
                "බිය සහ රළුබව ගැන",
                "දුර්වලකම සහ ශක්තිය ගැන",
                "අඥානකම සහ දැනුම ගැන",
              ],
              correctAnswer: "නිර්භීතකම සහ කරුණාව ගැන",
            },
          ],
          hard: [],
        },
      },
      {
        imageId: HerculesStoryImages.herculesImage4,
        passageId: 4,
        passageContent:
          "හර්කියුලිස් අවසානයේ ඔහුගේ දිව්‍යමය උරුමය සොයා ගත් අතර ඔහුගේ ඇදහිය නොහැකි ශක්තිය යහපත සඳහා යොදා ගැනීමෙන් සැබෑ වීරයෙකු විය හැකි බව වටහා ගත්තේය. ඔහුව රවටා ගත් නපුරු මායාකාරිය පරාජය කර ග්‍රීසියේ සියලු දෙනාගේ ඇස් හමුවේ වීරයෙකු විය.",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "ඔහු ඇත්තටම කවුදැයි හර්කියුලිස් සොයා ගත්තාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 2,
              question: "Did Hercules become a hero?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 3,
              question: "හර්කියුලිස් ඔහුගේ ශක්තිය හොඳ හෝ නරක සඳහා භාවිතා කළාද?",
              options: ["හොඳ", "නරක", "දෙකම", "නැත"],
              correctAnswer: "හොඳ",
            },
            {
              questionId: 4,
              question: "කතාව අවසානයේ හර්කියුලිස් පරාජය කළේ කවුද?",
              options: [
                "නපුරු මායාකාරිය",
                "ඔහුගේ මිතුරන්",
                "ඔහුගේ පවුල",
                "තමන්",
              ],
              correctAnswer: "නපුරු මායාකාරිය",
            },
            {
              questionId: 5,
              question: "සියලු ග්‍රීසියේ ඇස් හමුවේ හර්කියුලිස් වීරයෙක් වුනාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
          ],
          medium: [
            {
              questionId: 1,
              question: "හර්කියුලිස් සැබෑ වීරයෙකු වූයේ කෙසේද?",
              options: [
                "ඔහුගේ ඇදහිය නොහැකි ශක්තිය යහපත සඳහා භාවිතා කිරීමෙන්",
                "නපුරු මායාකාරිය පරාජය කිරීමෙන්",
                "ඔහුගේ දිව්යමය උරුමය සොයා ගැනීමෙන්",
                "ඉහත සියල්ලම",
              ],
              correctAnswer:
                "ඔහුගේ ඇදහිය නොහැකි ශක්තිය යහපත සඳහා භාවිතා කිරීමෙන්",
            },
            {
              questionId: 2,
              question: "ඔහුව රැවටූ නපුරු මායාකාරියට සිදු වූයේ කුමක්ද?",
              options: [
                "හර්කියුලිස් ඇයව පරාජය කළා",
                "ඇය වීරයෙක් වුනා",
                "ඇය ඇගේ දිව්‍ය උරුමය සොයා ගත්තා",
                "ඇය යහපත සඳහා ඇගේ ශක්තිය යෙදුවා",
              ],
              correctAnswer: "හර්කියුලිස් ඇයව පරාජය කළා",
            },
            {
              questionId: 3,
              question:
                "හර්කියුලිස් ඔහුගේ ඇදහිය නොහැකි ශක්තිය භාවිතා කළේ කෙසේද?",
              options: [
                "යහපත සඳහා",
                "නරක සඳහා",
                "හොඳ සහ නරක දෙකටම",
                "හොඳ හෝ නරක සඳහා",
              ],
              correctAnswer: "යහපත සඳහා",
            },
            {
              questionId: 4,
              question: "හර්කියුලිස් කුඩා කාලයේ ඔහුව රැවැට්ටුවේ කවුද?",
              options: [
                "නපුරු මායාකාරිය",
                "ඔහුගේ මිතුරන්",
                "ඔහුගේ පවුල",
                "තමන්",
              ],
              correctAnswer: "නපුරු මායාකාරිය",
            },
          ],
          hard: [],
        },
      },
      {
        imageId: HerculesStoryImages.herculesImage5,
        passageId: 5,
        passageContent:
          "හර්කියුලිස්ගේ ධෛර්යය, කරුණාව සහ ශක්තිය ඔහුව පුරාවෘත්ත වීරයෙකු බවට පත් කළේය, ඔහු සැබෑ දෙවියෙකු ලෙස ඔලිම්පස් කන්ද මත තම පවුලට නැවත එක් විය. වීරයෙකු බවට පත් කරන්නේ ශක්තිය පමණක් නොව ඔවුන්ගේ හදවතේ ඇති යහපත්කම බව ඔහු ඉගෙන ගත්තේය. එය අවසානයයි. හර්කියුලිස්ගේ විස්මිත කතාව!",
        questionBank: {
          easy: [
            {
              questionId: 1,
              question: "කතාව අවසානයේ හර්කියුලිස් ගියේ කොහේද?",
              options: [
                "ඔලිම්පස් කන්ද",
                "ඔහුගේ ගම",
                "වෙනත් ගවේෂණයක",
                "කොහේවත්",
              ],
              correctAnswer: "ඔලිම්පස් කන්ද",
            },
            {
              questionId: 2,
              question: "කතාව අවසානයේ හර්කියුලිස් දෙවියෙක්ද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 3,
              question: "කතාව අවසානයේ හර්කියුලිස් වීරයෙක්ද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
            {
              questionId: 4,
              question: "ඔලිම්පස් කන්ද කොහෙද?",
              options: [
                "දෙවියන් වැඩ සිටින තැන",
                "ඒක එයාගෙ ගමේ",
                "ඒක තවත් ගවේෂණයක",
                "ඒක කොහෙවත් නෑ",
              ],
              correctAnswer: "දෙවියන් වැඩ සිටින තැන",
            },
            {
              questionId: 5,
              question: "කතාව අවසානයේ හර්කියුලිස් යමක් ඉගෙන ගත්තාද?",
              options: ["ඔව්", "නෑ"],
              correctAnswer: "ඔව්",
            },
          ],
          medium: [
            {
              questionId: 1,
              question:
                "හර්කියුලිස් පුරාවෘත්ත වීරයෙකු බවට පත් කළ ගුණාංග මොනවාද?",
              options: [
                "ඔහුගේ ධෛර්යය, කරුණාව සහ ශක්තිය",
                "ඔහුගේ දුර්වලකම",
                "ඔහුගේ බිය",
                "ඔහුගේ රළුකම",
              ],
              correctAnswer: "ඔහුගේ ධෛර්යය, කරුණාව සහ ශක්තිය",
            },
            {
              questionId: 2,
              question: "වීරයෙකු වීම ගැන හර්කියුලිස් ඉගෙනගත්තේ කුමක්ද?",
              options: [
                "වීරයෙකු කරන්නේ ශක්තිය පමණක් නොව, ඔවුන්ගේ හදවතේ ඇති යහපත්කම",
                "ඒ ශක්තිය විතරයි වීරයෙක් කරන්නේ",
                "ඒ වීරයන් හැම විටම රළුයි",
                "ඒ වීරයන් නිතරම බයයි",
              ],
              correctAnswer:
                "වීරයෙකු කරන්නේ ශක්තිය පමණක් නොව, ඔවුන්ගේ හදවතේ ඇති යහපත්කම",
            },
            {
              questionId: 3,
              question: "හර්කියුලිස් පුරාවෘත්ත වීරයෙකු බවට පත් කළේ කුමක්ද?",
              options: [
                "ඔහුගේ ධෛර්යය, කරුණාව සහ ශක්තිය",
                "ඔහුගේ දුර්වලකම",
                "ඔහුගේ බිය",
                "ඔහුගේ රළුකම",
              ],
              correctAnswer: "ඔහුගේ ධෛර්යය, කරුණාව සහ ශක්තිය",
            },
            {
              questionId: 4,
              question:
                "හර්කියුලිස්ගේ කතාවට අනුව වීරයෙකු වීමට අවශ්ය වන්නේ කුමක්ද?",
              options: [
                "ශක්තිය පමණක් නොව, කෙනෙකුගේ හදවතේ ඇති යහපත්කමද",
                "ශක්තිය පමණි",
                "වීරයන් සැමවිටම රළු ය",
                "වීරයන් නිතරම බයයි",
              ],
              correctAnswer: "ශක්තිය පමණක් නොව, කෙනෙකුගේ හදවතේ ඇති යහපත්කමද",
            },
          ],
          hard: [],
        },
      },
    ],
  };
};
